InformationRegisters/ОбращенияВТехПоддержкуБИТ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОбращенияВТехПоддержкуБИТ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипЗапроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЗапросовТехПоддержкаБИТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСлужебнойИнформации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияЗапросовТехПоддержкаБИТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщениеОбОшибках</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Email</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УИДСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ОбращенияВТехПоддержкуБИТ/Ext/ManagerModule.bsl
Функция ОтправитьСообщение(Тема, Тело) Экспорт
	
	ТекстОшибки = "";
	
	Если ДостигнутоДопустимоеКоличествоОтправокЗапроса() Тогда
		ТекстОшибки = "Достигнуто допустимое количество отправленных запросов за сегодняшний день: %1";
		ТекстОшибки = СтрШаблон(ТекстОшибки, ДопустимоеКоличествоЗапросовНаДень());
	Иначе
		ПараметрыПисьма = Новый Структура;
		ИмяОтправителяПисем = НСтр("ru = 'auto sendler LK'");
		
		Письмо = Новый ИнтернетПочтовоеСообщение;
		Письмо.Тема = Тема;
		Текст = Письмо.Тексты.Добавить(Тело);
		Текст.ТипТекста = ТипТекстаПочтовогоСообщения.ПростойТекст;
		
		Получатель = Письмо.Получатели.Добавить("d.pismak@divera.kz");
		Получатель.ОтображаемоеИмя = ИмяОтправителяПисем;
		
		Письмо.ИмяОтправителя = "btimed_auto";
		Письмо.Отправитель.ОтображаемоеИмя = ИмяОтправителяПисем;
		Письмо.Отправитель.Адрес = "divera.mis.sender@mail.ru";

		ИнтернетПочта = Новый ИнтернетПочта;
			
		Профиль = Новый ИнтернетПочтовыйПрофиль;

		Профиль.АдресСервераSMTP = "smtp.mail.ru";
		Профиль.ПортSMTP         = 465;
		Профиль.ИспользоватьSSLSMTP = Истина;

	    Профиль.Таймаут = 15;
		Профиль.ПользовательSMTP = "divera.mis.sender@mail.ru";
		
		Профиль.ПарольSMTP = Key();
		Попытка
			ИнтернетПочта.Подключиться(Профиль);
			ИнтернетПочта.Послать(Письмо);
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция Key()
	Возврат "VHiHZQIbeWgGc3OBw7CQ"; // HFkd41VYD4rBsS2CnFMg
КонецФункции

Функция ДостигнутоДопустимоеКоличествоОтправокЗапроса()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаОтправки", НачалоДня(ТекущаяДата()));
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОбращенияВТехПоддержкуБИТ.УИДСообщения КАК УИДСообщения
	|ИЗ
	|	РегистрСведений.ОбращенияВТехПоддержкуБИТ КАК ОбращенияВТехПоддержкуБИТ
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ОбращенияВТехПоддержкуБИТ.ДатаОтправки, ДЕНЬ) = &ДатаОтправки"
	;
	
	Выб = Запрос.Выполнить().Выбрать();
	
	Количество = Выб.Количество();
	
	Возврат Количество >= ДопустимоеКоличествоЗапросовНаДень();
	
КонецФункции

Функция ДопустимоеКоличествоЗапросовНаДень()
	
	Возврат 10;
	
КонецФункции
